<html>
<head>
<title>La computadora</title>
</head>
<body bgcolor="#8F8FBD">
<table width="1200" height="576">
<tr>
<td width="695"><h1>Primera Generaci&oacute;n</h1>
<p><br/>
En esta generaci&oacute;n hab&iacute;a una gran desconocimiento de las capacidades de las
computadoras, puesto que se realiz&oacute; un estudio en esta &eacute;poca que
determin&oacute; que con veinte computadoras se saturar&iacute;a el mercado de los
Estados Unidos en el campo de procesamiento de datos.<br />
Esta generaci&oacute;n abarco la d&eacute;cada de los cincuenta. Y se conoce como la
primera generaci&oacute;n. Estas m&aacute;quinas ten&iacute;an las siguientes
caracter&iacute;sticas:<br />
Estas m&aacute;quinas estaban construidas por medio de tubos de vac&iacute;o.<br />
Eran programadas en lenguaje de m&aacute;quina.<br />
En esta generaci&oacute;n las m&aacute;quinas son grandes y costosas (de un costo
aproximado de ciento de miles de d&oacute;lares).</p>
<p>En 1951 aparece la UNIVAC (NIVersAl Computer), fue la primera computadora comercial,
que dispon&iacute;a de mil palabras de memoria central y pod&iacute;anleer cintas
magn&eacute;ticas, se utiliz&oacute; para procesar el censo de 1950 en los Estados
Unidos.<br />
En las dos primeras generaciones, las unidades de entrada utilizaban tarjetas perforadas,
retomadas por Herman Hollerith (1860 - 1929), quien adem&aacute;s fund&oacute; una
compa&ntilde;&iacute;a que con el paso del tiempo se conocer&iacute;a como IBM
(International Bussines Machines).<br />
Despu&eacute;s se desarroll&oacute; por IBM la IBM 701 de la cual se entregaron 18
unidades entre 1953 y 1957.<br />
Posteriormente, la compa&ntilde;&iacute;a Remington Rand fabric&oacute; el modelo 1103,
que compet&iacute;a con la 701 en el campo cient&iacute;fico, por lo que la IBM desarrollo
la 702, la cual present&oacute; problemas en memoria, debido a esto no dur&oacute; en el
mercado.<br />
La computadora m&aacute;s exitosa de la primera generaci&oacute;n fue la IBM 650, de la
cual se produjeron varios cientos. Esta computadora que usaba un esquema de memoria
secundaria llamado tambor magn&eacute;tico, que es el antecesor de los discos actuales.<br
/>
Otros modelos de computadora que se pueden situar en los inicios de la segunda
generaci&oacute;n son: la UNIVAC 80 y 90, las IBM 704 y 709, Burroughs 220 y UNIVAC
1105.</p></td>
<td width="489"><h1 align="center"><img src="pgeneracion.jpg" width="359" height="235"
/></h1>
</td>
</tr>
</table>
<marquee behavior="alternate"><font color="#215E21"><h3>PRIMERA GENERACION</h3>
</marquee></font>
</body>
</html>