<html>
<head>
<title>La computadora</title>
</head>
<body bgcolor="#8F8FBD">
<table width="1094">
<tr>
<td width="661"><h1>Segunda Generaci&oacute;n</h1><p><br/>
Cerca de la d&eacute;cada de 1960, las computadoras segu&iacute;an evolucionando, se
reduc&iacute;a su tama&ntilde;o y crec&iacute;a su capacidad de procesamiento.
Tambi&eacute;n en esta &eacute;poca se empez&oacute; a definir la forma de comunicarse
con las computadoras, que recib&iacute;a el nombre de programaci&oacute;n de sistemas.<br
/>
Las caracter&iacute;sticas de la segunda generaci&oacute;n son las siguientes:<br />
Est&aacute;n construidas con circuitos de transistores.<br />
Se programan en nuevos lenguajes llamados lenguajes de alto nivel.<br />
En esta generaci&oacute;n las computadoras se reducen de tama&ntilde;o y son de menor
costo. Aparecen muchas compa&ntilde;&iacute;as y las computadoras eran bastante
avanzadas para su &eacute;poca como la serie 5000 de Burroughs y la ATLAS de la Universidad
de Manchester.<br />
Algunas de estas computadoras se programaban con cintas perforadas y otras m&aacute;s por
medio de cableado en un tablero. Los programas eran hechos a la medida por un equipo de
expertos: analistas, dise&ntilde;adores, programadores y operadores que se manejaban como
una orquesta para resolver los problemas y c&aacute;lculos solicitados por la
administraci&oacute;n. El usuario final de la informaci&oacute;n no ten&iacute;a contacto
directo con las computadoras. Esta situaci&oacute;n en un principio se produjo en las primeras
computadoras personales, pues se requer&iacute;a saberlas &quot;programar&quot;
(alimentarle instrucciones) para obtener resultados; por lo tanto su uso estaba limitado a
aquellos audaces pioneros que gustaran de pasar un buen n&uacute;mero de horas
escribiendo instrucciones, &quot;corriendo&quot; el programa resultante y verificando y
corrigiendo los errores o bugs que aparecieran. Adem&aacute;s, para no perder el
&quot;programa&quot; resultante hab&iacute;a que &quot;guardarlo&quot; (almacenarlo) en
una grabadora de astte, pues en esa &eacute;poca no hab&iacute;a discos flexibles y mucho
menosdiscos duros para las PC; este procedimiento pod&iacute;a tomar de 10 a 45 minutos,
seg&uacute;n el programa. El panorama se modific&oacute; totalmente con la

aparici&oacute;n de las computadoras personales con mejore circuitos, m&aacute;s memoria,
unidades de disco flexible y sobre todo con la aparici&oacute;n de programas de
aplicaci&oacute;n general en donde el usuario compra el programa y se pone a trabajar.
Aparecen los programas procesadores de palabras como el c&eacute;lebreWord Star, la
impresionante hoja de c&aacute;lculo (spreadsheet) Visicalc y otros m&aacute;s que de la
noche a la ma&ntilde;ana cambian la imagen de la PC. El sortware empieza a tratar de alcanzar
el paso del hardware. Pero aqu&iacute; aparece un nuevo elemento: el usuario.<br />
</td>
<td width="417"><div align="center"><img src="sgeneracion.jpg" width="359"
height="235"></div></td>
</tr>
</table>
<marquee behavior="alternate"><font color="#215E21"><h3>SEGUNDA GENERACION</h3>
</marquee></font>
</body>
</html>